# Taps
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nicoverbruggen/cask"
tap "nicoverbruggen/homebrew-cask"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "sst/tap"
tap "tw93/tap"
tap "hungthai1401/tap"

# Binaries
brew "fzf"
brew "mas" # Mac App Store manager
brew "mackup"
brew "tmux"
brew "lazydocker"
brew "lazygit"
brew "the_silver_searcher"
brew "bat"
brew "neovim"
brew "ripgrep"
brew "ast-grep"
brew "tw93/tap/mole"

# Go
brew "go"

# Nodejs
brew "nvm"
brew "yarn"

# Kubernetes
brew "kubectl"
brew "derailed/k9s/k9s"

# Zsh
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# PHP
brew "composer"
brew "shivammathur/php/php@8.1"
brew "shivammathur/extensions/xdebug@8.1"

# Coding tools
brew "sst/tap/opencode"
brew "hungthai1401/tap/occtx"

# Python
brew "uv"

# Apps
#cask "another-redis-desktop-manager"
cask "bitwarden"
cask "bruno"
cask "fork"
cask "iterm2"
cask "itsycal"
cask "nikitabobko/tap/aerospace"
cask "phpmon"
cask "stats"

# Font
cask "font-jetbrains-mono-nerd-font"

# Mac App Store
mas "Perplexity", id: 6714467650
