# Taps
tap "hashicorp/tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "nicoverbruggen/cask"
tap "nicoverbruggen/homebrew-cask"
tap "shivammathur/extensions"
tap "shivammathur/php"
tap "brotherbui/homebrew"

# Binaries
brew "fzf"
brew "go"
brew "mas" # Mac App Store manager
brew "mackup"
brew "tmux"
brew "composer"
brew "nvm"
brew "lazydocker"
brew "lazygit"
brew "uv"

# Zsh
brew "z"
brew "zsh"
brew "zsh-completions"
brew "zsh-syntax-highlighting"

# PHP
brew "shivammathur/php/php@8.1"
brew "shivammathur/extensions/xdebug@8.1"

# Apps
cask "another-redis-desktop-manager"
cask "bitwarden"
cask "bruno"
cask "fork"
cask "iterm2"
cask "itsycal"
cask "nikitabobko/tap/aerospace"
cask "phpmon"

# Mac App Store
mas "Perplexity", id: 6714467650
